//Написать программу, которая вычисляет выражение 20 - (2*2-8) и печатает результат на экране.
using Tyuiu.MkhitaryanSG.Sprint1.Task0.V15.Lib;

{
    DataService ds = new DataService();
    Console.Title = "Спринт #1 | Выполнила: Мхитарян С. Г. | РППб-25-1";
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* Спринт #1                                                               *");
    Console.WriteLine("* Тема: Базовые навыки работы в C#                                        *");
    Console.WriteLine("* Задание #0                                                              *");
    Console.WriteLine("* Вариант #10                                                             *");
    Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                        *");
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* УСЛОВИЕ:                                                                *");
    Console.WriteLine("* Написать программу, вычисляющую выражение 20 - (2*2-8)                  *");
    Console.WriteLine("* и печатает результат на экране.                                         *");
    Console.WriteLine("*                                                                         *");
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                         *");
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* 20 - (2*2-8)                                                            *");
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
    Console.WriteLine("***************************************************************************");

    Console.WriteLine(ds.Calculate());

    Console.ReadLine();
}