//Написать программу, которая запрашивает у пользователя исходные данные, выполняет указанные расчёты и печатает результат на экране.
//Расчеты:
//Написать программу вычисления расстояния между населенными пунктами, изображенными на карте. Ответ округлите до 3 знаков после запятой.
//Масштаб карты (количество км. в одном см.) -> 120
//Расстояние между точками, изображающими населенные пункты (см) -> 3.5
//Расстояние между населенными пунктами 420 км.
using Tyuiu.MkhitaryanSG.Sprint1.Task3.V5.Lib;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Console.Title = "Спринт #1 | Выполнила: Мхитарян С. Г. | РППб-25-1";
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* Спринт #1                                                               *");
        Console.WriteLine("* Тема: Операторы составного присваивания                                 *");
        Console.WriteLine("* Задание #3                                                              *");
        Console.WriteLine("* Вариант #5                                                             *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                        *");
        Console.WriteLine("***************************************************************************");

        Console.WriteLine("* УСЛОВИЕ:                                                                *");
        Console.WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные, *");
        Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.             *");
        Console.WriteLine("*                                                                         *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                         *");
        Console.WriteLine("***************************************************************************");

        Console.Write("Введите масштаб карты (км в 1 см): ");
        double mapScale = Convert.ToDouble(Console.ReadLine());

        Console.Write("Введите расстояние между населенными пунктами (в см): ");
        double distanceInCm = Convert.ToDouble(Console.ReadLine());

        double result = ds.DistanceLength(mapScale, distanceInCm);//км

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        Console.WriteLine($"Расстояние между населенными пунктами: {result} км");//округ и вывод
    }
}