//Вариант 15
//Написать программу, которая запрашивает у пользователя исходные данные, выполняет указанные расчёты и печатает результат на экране.
//Формулировка задания: Известна длина стороны куба. Вычислить объём куба.
//Что пользователь вводит? Длина стороны куба (целое число)
//Что программа печатает на экране? Объём куба (целое число)
using Tyuiu.MkhitaryanSG.Sprint1.Task2.V15.Lib;
{
    DataService ds = new DataService();
    Console.Title = "Спринт #1 | Выполнила: Мхитарян С. Г. | РППб-25-1";
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* Спринт #1                                                               *");
    Console.WriteLine("* Тема: Арифметические операторы в C#                                     *");
    Console.WriteLine("* Задание #2                                                              *");
    Console.WriteLine("* Вариант #15                                                             *");
    Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                        *");
    Console.WriteLine("***************************************************************************");

    Console.WriteLine("* УСЛОВИЕ:                                                                *");
    Console.WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные, *");
    Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.             *");
    Console.WriteLine("*                                                                         *");
    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                         *");
    Console.WriteLine("***************************************************************************");

    int x;
    Console.WriteLine("Введите длину стороны куба:");
    x = Convert.ToInt32(Console.ReadLine());

    Console.WriteLine("***************************************************************************");
    Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
    Console.WriteLine("***************************************************************************");

    Console.WriteLine("Объём куба: " + ds.CalculateCubeVolume(x));
    Console.ReadLine();
}
